Revit 2027 API
DirectShapeLibrary.Contains Method
 A quick check whether a definition already exists in the library. Checks for stored geometry objects only.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Contains(
	string id
)
Public Function Contains (
	id As String
) As Boolean
public:
bool Contains(
	String^ id
)
member Contains :
        id : string -> bool
Parameters
id String
 Definition id
Return Value
Boolean
 True if a geometry definition exists, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace